Merge pull request #41 from sowoi/release/1.14.2
Release/1.14.2
